package primery.zadachi;

import java.util.Scanner;

public class NumFromArr {
    //даны два массива с цифрами. нужно собрать из них максимальное число с заданным количеством цифр
    //последовательность цифр внутри массива менять нельзя. т.е. для масива
    //[7,8,1] и [5,6,2] максимальное духзначное число будет 86 а не 87

    public static void main(String[] args) {
        int[] arr1 = {2, 7, 5};
        int[] arr2 = {6, 8, 2};
        int kolNum = 1;

        //1 - 8
        //2 - 87
        //3 - 875
        //4 - 8752
        //5 - 82752
        //6 - 682752
        //todo: и как это, нафиг, сделать?!



    }
}
